import React from 'react';

export default function AboutPlatform() {
  return (
    <div className="p-8 bg-gradient-to-r from-blue-50 to-blue-100 flex items-start space-x-4 transition-shadow duration-300">
      <div className="bg-blue-600 p-3 rounded-full flex-shrink-0">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="32"
          height="32"
          viewBox="0 0 1024 1024"
          className="text-white"
        >
          <path
            fill="currentColor"
            fillRule="evenodd"
            d="M672.073 786.477H533.036V200.534h139.037v585.943zM483.019 493.596c0 133.44-108.16 241.419-241.419 241.419S0 626.855 0 493.596c0-133.259 108.16-241.419 241.419-241.419s241.6 107.98 241.6 241.419zm-168.289 0c0-40.447-32.683-73.13-73.13-73.13s-73.13 32.683-73.13 73.13c0 40.447 32.683 73.13 73.13 73.13s73.13-32.683 73.13-73.13zm708.909-146.802h-92.27l-54.17 54.17-54.17-54.17h-92.27v93.895l53.448 53.448-53.448 53.448v92.631h93.715l52.906-52.906 52.906 52.906h93.715v-92.631l-53.448-53.448 53.448-53.448v-93.895h-.361z"
          ></path>
        </svg>
      </div>
      <p className="text-sm text-gray-800 leading-relaxed">
        <span className="font-semibold">Local Experts</span> е платформа за обяви в категории: Недвижими имоти, Автомобили и авточасти,
        Електроника, Мода, За бебето и детето, Дом и градина, Свободно време, Домашни любимци, Услуги,
        Работа, Екскурзии и почивки. Тук може да намериш интересни обяви и лесно да се свържеш с продавача.
        Ако искаш да купиш нещо — може да намериш атрактивни предложения на цени, по-ниски, отколкото в магазина.
        Ако искаш да продадеш нещо — можеш да добавиш обява бързо, лесно и безплатно (до определен лимит) и да пуснеш
        за продажба практически всичко, за което се сетиш.
      </p>
    </div>
  );
}
